MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAM4LC8BA/mcu.h
/**
 * \file
 *
 * \brief Header file for SAM4LC8B
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4LC8B_
#define _SAM4LC8B_

/**
 * \ingroup SAM4L_definitions
 * \addtogroup SAM4LC8B_definitions SAM4LC8B definitions
 * This file defines all structures and symbols for SAM4LC8B:
 *   - registers and bitfields
 *   - peripheral base address
 *   - peripheral ID
 *   - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#if !defined(_UL)
#define _U(x)          x ## U            /**< C code: Unsigned integer literal constant value */
#define _L(x)          x ## L            /**< C code: Long integer literal constant value */
#define _UL(x)         x ## UL           /**< C code: Unsigned Long integer literal constant value */
#endif
#else
#if !defined(_UL)
#define _U(x)          x                 /**< Assembler: Unsigned integer literal constant value */
#define _L(x)          x                 /**< Assembler: Long integer literal constant value */
#define _UL(x)         x                 /**< Assembler: Unsigned Long integer literal constant value */
#endif
#endif

/* ************************************************************************** */
/**  CMSIS DEFINITIONS FOR SAM4LC8B */
/* ************************************************************************** */
/** \defgroup SAM4LC8B_cmsis CMSIS Definitions */
/*@{*/

/** Interrupt Number Definition */
typedef enum IRQn
{
  /******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn      = -14,/**<  2 Non Maskable Interrupt                */
  HardFault_IRQn           = -13,/**<  3 Cortex-M4 Hard Fault Interrupt        */
  MemoryManagement_IRQn    = -12,/**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn            = -11,/**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn          = -10,/**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn              = -5, /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn        = -4, /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn              = -2, /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn             = -1, /**< 15 Cortex-M4 System Tick Interrupt       */
  /******  SAM4LC8B-specific Interrupt Numbers ***********************/
  HFLASHC_IRQn             =  0, /**<  0 SAM4LC8B Flash Controller (HFLASHC) */
  PDCA_0_IRQn              =  1, /**<  1 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_0 */
  PDCA_1_IRQn              =  2, /**<  2 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_1 */
  PDCA_2_IRQn              =  3, /**<  3 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_2 */
  PDCA_3_IRQn              =  4, /**<  4 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_3 */
  PDCA_4_IRQn              =  5, /**<  5 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_4 */
  PDCA_5_IRQn              =  6, /**<  6 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_5 */
  PDCA_6_IRQn              =  7, /**<  7 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_6 */
  PDCA_7_IRQn              =  8, /**<  8 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_7 */
  PDCA_8_IRQn              =  9, /**<  9 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_8 */
  PDCA_9_IRQn              = 10, /**< 10 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_9 */
  PDCA_10_IRQn             = 11, /**< 11 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_10 */
  PDCA_11_IRQn             = 12, /**< 12 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_11 */
  PDCA_12_IRQn             = 13, /**< 13 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_12 */
  PDCA_13_IRQn             = 14, /**< 14 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_13 */
  PDCA_14_IRQn             = 15, /**< 15 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_14 */
  PDCA_15_IRQn             = 16, /**< 16 SAM4LC8B Peripheral DMA Controller (PDCA): PDCA_15 */
  CRCCU_IRQn               = 17, /**< 17 SAM4LC8B CRC Calculation Unit (CRCCU) */
  USBC_IRQn                = 18, /**< 18 SAM4LC8B USB 2.0 Interface (USBC) */
  PEVC_0_IRQn              = 19, /**< 19 SAM4LC8B Peripheral Event Controller (PEVC): PEVC_TR */
  PEVC_1_IRQn              = 20, /**< 20 SAM4LC8B Peripheral Event Controller (PEVC): PEVC_OV */
  AESA_IRQn                = 21, /**< 21 SAM4LC8B Advanced Encryption Standard (AESA) */
  PM_IRQn                  = 22, /**< 22 SAM4LC8B Power Manager (PM) */
  SCIF_IRQn                = 23, /**< 23 SAM4LC8B System Control Interface (SCIF) */
  FREQM_IRQn               = 24, /**< 24 SAM4LC8B Frequency Meter (FREQM) */
  GPIO_0_IRQn              = 25, /**< 25 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_0 */
  GPIO_1_IRQn              = 26, /**< 26 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_1 */
  GPIO_2_IRQn              = 27, /**< 27 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_2 */
  GPIO_3_IRQn              = 28, /**< 28 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_3 */
  GPIO_4_IRQn              = 29, /**< 29 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_4 */
  GPIO_5_IRQn              = 30, /**< 30 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_5 */
  GPIO_6_IRQn              = 31, /**< 31 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_6 */
  GPIO_7_IRQn              = 32, /**< 32 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_7 */
  GPIO_8_IRQn              = 33, /**< 33 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_8 */
  GPIO_9_IRQn              = 34, /**< 34 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_9 */
  GPIO_10_IRQn             = 35, /**< 35 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_10 */
  GPIO_11_IRQn             = 36, /**< 36 SAM4LC8B General-Purpose Input/Output Controller (GPIO): GPIO_11 */
  BPM_IRQn                 = 37, /**< 37 SAM4LC8B Backup Power Manager (BPM) */
  BSCIF_IRQn               = 38, /**< 38 SAM4LC8B Backup System Control Interface (BSCIF) */
  AST_0_IRQn               = 39, /**< 39 SAM4LC8B Asynchronous Timer (AST): AST_ALARM */
  AST_1_IRQn               = 40, /**< 40 SAM4LC8B Asynchronous Timer (AST): AST_PER */
  AST_2_IRQn               = 41, /**< 41 SAM4LC8B Asynchronous Timer (AST): AST_OVF */
  AST_3_IRQn               = 42, /**< 42 SAM4LC8B Asynchronous Timer (AST): AST_READY */
  AST_4_IRQn               = 43, /**< 43 SAM4LC8B Asynchronous Timer (AST): AST_CLKREADY */
  WDT_IRQn                 = 44, /**< 44 SAM4LC8B Watchdog Timer (WDT) */
  EIC_0_IRQn               = 45, /**< 45 SAM4LC8B External Interrupt Controller (EIC): EIC_1 */
  EIC_1_IRQn               = 46, /**< 46 SAM4LC8B External Interrupt Controller (EIC): EIC_2 */
  EIC_2_IRQn               = 47, /**< 47 SAM4LC8B External Interrupt Controller (EIC): EIC_3 */
  EIC_3_IRQn               = 48, /**< 48 SAM4LC8B External Interrupt Controller (EIC): EIC_4 */
  EIC_4_IRQn               = 49, /**< 49 SAM4LC8B External Interrupt Controller (EIC): EIC_5 */
  EIC_5_IRQn               = 50, /**< 50 SAM4LC8B External Interrupt Controller (EIC): EIC_6 */
  EIC_6_IRQn               = 51, /**< 51 SAM4LC8B External Interrupt Controller (EIC): EIC_7 */
  EIC_7_IRQn               = 52, /**< 52 SAM4LC8B External Interrupt Controller (EIC): EIC_8 */
  IISC_IRQn                = 53, /**< 53 SAM4LC8B Inter-IC Sound (I2S) Controller (IISC) */
  SPI_IRQn                 = 54, /**< 54 SAM4LC8B Serial Peripheral Interface (SPI) */
  TC0_0_IRQn               = 55, /**< 55 SAM4LC8B Timer/Counter 0 (TC0): TC00 */
  TC0_1_IRQn               = 56, /**< 56 SAM4LC8B Timer/Counter 0 (TC0): TC01 */
  TC0_2_IRQn               = 57, /**< 57 SAM4LC8B Timer/Counter 0 (TC0): TC02 */
  TC1_0_IRQn               = 58, /**< 58 SAM4LC8B Timer/Counter 1 (TC1): TC10 */
  TC1_1_IRQn               = 59, /**< 59 SAM4LC8B Timer/Counter 1 (TC1): TC11 */
  TC1_2_IRQn               = 60, /**< 60 SAM4LC8B Timer/Counter 1 (TC1): TC12 */
  TWIM0_IRQn               = 61, /**< 61 SAM4LC8B Two-wire Master Interface 0 (TWIM0) */
  TWIS0_IRQn               = 62, /**< 62 SAM4LC8B Two-wire Slave Interface 0 (TWIS0) */
  TWIM1_IRQn               = 63, /**< 63 SAM4LC8B Two-wire Master Interface 1 (TWIM1) */
  TWIS1_IRQn               = 64, /**< 64 SAM4LC8B Two-wire Slave Interface 1 (TWIS1) */
  USART0_IRQn              = 65, /**< 65 SAM4LC8B Universal Synchronous Asynchronous Receiver Transmitter 0 (USART0) */
  USART1_IRQn              = 66, /**< 66 SAM4LC8B Universal Synchronous Asynchronous Receiver Transmitter 1 (USART1) */
  USART2_IRQn              = 67, /**< 67 SAM4LC8B Universal Synchronous Asynchronous Receiver Transmitter 2 (USART2) */
  USART3_IRQn              = 68, /**< 68 SAM4LC8B Universal Synchronous Asynchronous Receiver Transmitter 3 (USART3) */
  ADCIFE_IRQn              = 69, /**< 69 SAM4LC8B ADC controller interface (ADCIFE) */
  DACC_IRQn                = 70, /**< 70 SAM4LC8B DAC Controller (DACC) */
  ACIFC_IRQn               = 71, /**< 71 SAM4LC8B Analog Comparator Interface (ACIFC) */
  ABDACB_IRQn              = 72, /**< 72 SAM4LC8B Audio Bitstream DAC (ABDACB) */
  TRNG_IRQn                = 73, /**< 73 SAM4LC8B True Random Number Generator (TRNG) */
  PARC_IRQn                = 74, /**< 74 SAM4LC8B Parallel Capture (PARC) */
  CATB_IRQn                = 75, /**< 75 SAM4LC8B Capacitive Touch Module B (CATB) */
  TWIM2_IRQn               = 77, /**< 77 SAM4LC8B Two-wire Master Interface 2 (TWIM2) */
  TWIM3_IRQn               = 78, /**< 78 SAM4LC8B Two-wire Master Interface 3 (TWIM3) */
  LCDCA_IRQn               = 79, /**< 79 SAM4LC8B LCD Controller (LCDCA) */

  PERIPH_COUNT_IRQn        = 80  /**< Number of peripheral IDs */
} IRQn_Type;

